Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་དབང་ཕྱུག་དགོད་པར་བྱའོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་དྲུང་དུ། རྫས་ཀྱི་སྣོད་གཞག་པར་བྱ་ཞིང་།
en: He should draw the Lokeśvara in the center of the lotus, upon the filaments, and place the bowl with the power substance at the feet of Noble Avalokiteśvara.

source: མེ་ཏོག་གཅལ་དུ་བཀྲམ་པར་བྱ་ལ། དཀྱིལ་འཁོར་བརྒྱན་པར་བྱ་སྟེ། དྲི་དང་། ཡོན་ཆད་དབུལ་བར་བྱ་ཞིང་། ཙནྡན་གྱི་བདུག་པ་སྲེག་གོ།
en: He should strew the maṇḍala with flowers, adorn it, offer perfumed argha water, and burn sandalwood incense.

source: །ཉིན་མཚན་དུ་གོས་གཙང་མ་བགོ་ཞིང་བཅིང་བར་བྱ། ཤིན་ཏུ་དྲི་མ་མེད་པའི་སེམས་དུ་འགྱུར་བར་བྱ། བྱམས་པ་དང་། སྙིང་རྗེ་མཆོག་ཏུ་འགྱུར་བར་བྱ་ཞིང་།
en: Day and night, he should wear clean clothes, maintain pure thoughts, and cultivate love and compassion with all his heart.

source: དེ་ནས་ནོར་བུའི་རྫས་སྨྲས་པོ་ཞེས་སོ།
en: This is the practice of the precious power substance. “

source: །ནོར་བུའི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའོ།། །།
en: This concludes the instructions on the maṇḍala of the jewel. “

source: དེ་ནས་ལྡོང་རོས་ཀྱི་མིག་སྨན་གྱི་ཆོ་གའི་དཀྱིལ་འཁོར་བཤད་པར་བྱ་སྟེ།
en: Now I will teach the maṇḍala procedure of the realgar ointment for the eyes.

source: རྒྱར་གཟིངས་ཀྱི་ཆའི་མཐར་ཐུག་པས་དཀྱིལ་འཁོར་གྲུ་བཞི་པ་བྱས་ཏེ།
en: This maṇḍala should have four sides and an area the size of a boat.

source: དྲི་སྣ་ཚོགས་དང་། རྣམ་པར་བཀྲ་བའི་རིག་སྔགས་འཆང་ནི།
en: It should be perfumed with various fragrances and be brightly colored.

source: གྲྭ་རྣམས་སུ་མཁས་པར་བྲི་བར་བྱའོ།
en: The wise and learned vidyā holder should draw a vidyādhara in each of the four corners.

source: །དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོར། པདྨ་འདབ་མ་ཕྱེད་ཁ་བྱེ་བའོ། །ལག་པ་གཉིས་ཀྱི་དབུས་སུ་པདྨ་གེ་སར་རྒྱས་པ་འཆང་བའོ།
en: In the very center of the maṇḍala he should draw a half-open lotus with a pair of hands among its filaments, each holding a lotus.

source: །ཤར་གྱི་སྒོ་རྣམ་པར་ཕྱེ་བ་བྱ་སྟེ།
en: The door to the maṇḍala should point toward the east.

source: ལྡོང་རོས་དངུལ་གྱི་སྣོད་དུ་བཞག་ནས་དཀྱིལ་འཁོར་དུ་པདྨའི་སྟེང་དུ་དགོད་པར་བྱའོ། །སྣོད་ཀྱི་ཁོར་ཡུག་ཏུ།
en: The vidyā holder should then put some realgar into a silver bowl and place the bowl upon the lotus in the maṇḍala.

source: དར་དམར་པོའི་གོས་བཟང་པོས་གཡོག་པར་བྱའོ། །ཡང་ན་པདྨའི་འདབ་མའམ། ཡང་ན་བྱང་ཆུབ་ཤིང་གི་འདབ་མའམ། ཡང་ན་ཤིང་འཛམ་བུའི་འདབ་མས་གཡོག་པར་བྱའོ། །ཨ་ག་རུའི་བདུག་པ་དབུལ་བར་བྱའོ།
en: The surface of the bowl should be entirely covered with red silk of good quality, or it can be covered with lotus leaves, leaves of the bodhi tree, or leaves of the rose-apple tree. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་ཞགས་པའི་གཟུགས་འཛིན་པ་པདྨའི་འདབ་མའི་དྲུང་དུ་དགོད་པར་བྱའོ།
en: The vidyā holder should offer incense of agarwood to Noble Avalokiteśvara in his form of Amoghapāśa, placing it near the petals of the lotus.

source: །མེ་ཏོག་དང་། དྲིས་མཆོད་པ་བྱ།
en: He should likewise offer flowers and fragrances.

source: རིག་སྔགས་འཆང་གིས་དཀར་གསུམ་ཟོས་ལ་འཕགས་པའི་ཡན་ལག་བརྒྱད་ཀྱི་བསྙེན་གནས་སུ་འགྱུར་བར་བྱའོ། །ཡང་ན་ཉིན་མཚན་དུ་སྨྱུང་བར་གནས་པ་བྱ། ཟླ་བ་ཡར་ངོ་འམ།
en: He should adhere to the eightfold path of the noble ones and either subsist on the three ‘white’ foods or observe the ritual fast for one day and one night.

source: ཚེས་བཅོ་ལྔའི་ཉའམ། ཚེས་བཅུ་བཞི་འམ། ཚེས་བརྒྱད་ལ། གཙང་མར་ཁྲུས་བྱས་ཏེ། གོས་གཙང་མ་བགོ་བར་བྱ།
en: Starting on the fifteenth, the day of the full moon, the fourteenth, or the eighth lunar day of the bright fortnight, he should purify himself ritually, bathe thoroughly, and put on clean clothes.

source: དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཤིང་། སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་ཀྱང་བཟླས་པར་བྱ།
en: He should recite both the heart essence of Amoghapāśa and the heart mantra one hundred and eight times.

source: ཡི་གེ་གཅིག་པ་སྟོང་ཕྲག་བཅུར་བཟླས་ལ།
en: He should then recite the one-syllable mantra ten thousand times. “

source: དཀྱིལ་འཁོར་ཉེ་བར་སྤྲས་ཤིང་མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། མར་མེ་དང་། གཏོར་མ་དབུལ་བར་བྱའོ།
en: The vidyā holder should adorn the maṇḍala with flowers, cense it with incense, perfume it, and arrange a row of lamps inside it.

source: །དེ་ནས་ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་པར་བྱ་སྟེ། དཀྱིལ་འཁོར་གྱི་སྟེང་དུ་འཕང་བར་བྱའོ།
en: He should incant mustard seeds twenty-one times with the mantra and cast them upon the maṇḍala.

source: །འཕངས་པ་ཙམ་གྱི་མོད་ལ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ལུས་ལས་འོད་ཟེར་སྣ་ཚོགས་འབྱིན་པར་བྱེད་དོ། ལྡོང་རོས་ཀྱི་སྣོད་དེ་ཡང་འབར་བར་བྱེད་དེ།
en: As soon as they are cast, the body of Noble Avalokiteśvara will emit light rays of various colors, and the bowl with the realgar will blaze with light.

source: འབར་བ་ཙམ་གྱི་མོད་ལ་མིག་ལ་བསྐུས་ན་ནམ་མཁའ་ལ་འགྲོའོ།
en: As soon as it blazes, the vidyā holder should anoint his eyes with it.

source: །དོན་ཡོད་པའི་ཡེ་ཤེས་ཡངས་པ་ཡིད་བཞིན་གྱི་ནོར་བུའི་འོད་ཟེར་གྱི་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་བོ།
en: He will rise into the air and obtain the samādhi called the vast effulgent display of amogha wisdom that is like a wish-fulfilling jewel.

source: །དོན་ཡོད་པའི་འཁོར་ལོ་ཀུན་ནས་རྣམ་པར་གཟིགས་པ་ཞེས་བྱ་བའི་རིག་སྔགས་འཆང་གི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་ཏེ། རིག་སྔགས་འཆག་གི་འཁོར་ལོས་སྒྱུར་བ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: He will become an emperor of the vidyādharas with the name Panoptic Noose-Gaze Like an Amogha Wheel and will have a retinue of hundreds of thousands of millions of billions of other vidyādhara emperors, as numerous as the grains of sand in the ninety-nine Gaṅgā rivers. “

source: །ཐམས་ཅད་དུ་གནས་ཀྱི་མངའ་བདག་རྒྱལ་པོར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་འགྲོ་ཞིང་།
en: He will become a powerful lord and king of the realm in every respect and be able to visit all buddha fields.

source: ཚེ་བསྐལ་པ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ། །རྒྱལ་བ་འོད་དཔག་མེད་ཀྱི་ཅོད་པན་འཆང་བར་འགྱུར་རོ།
en: His lifespan will increase to an infinite eon, and the victorious Amitābha will be his crest jewel.

source: །དོན་ཡོད་པ་དྲི་མ་མེད་པའི་སྤྱན་ཞེས་བྱ་བའི་རྫུ་འཕྲུལ་སོ་སོར་ཐོབ་སྟེ། རྫུ་འཕྲུལ་གང་གིས་སེ་གོལ་གཏོགས་པ་ཙམ་གྱིས། སངས་རྒྱས་ཀྱི་ཞིང་། གང་གཱའི་ཀླུང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུར་འགྲོ་བར་འགྱུར་རོ།
en: He will obtain the magical power called pure amogha vision, whereby he will be able, in the time it takes to snap a finger, to visit hundreds of thousands of millions of billions of buddha fields, as numerous as grains of sand in ninety-nine Gaṅgā rivers.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དོན་ཡོད་པའི་དངོས་གྲུབ་ཡངས་པའི་མཆོད་པ་བྱེད་པར་འགྱུར་ཞིང་སྐད་ཅིག་གིས་སླར་ཡང་འོང་བར་བྱེད་དོ།
en: All the tathāgatas there will grant him amogha accomplishments and bestow upon him vast offerings, after which he will return instantly to his original location.

source: །རང་གི་ལུས་ལ་འོད་ཟེར་བརྒྱ་སྟོང་ཕྲག་དུ་མ་འབར་བར་བྱེད་དོ། །གང་འདོད་པ་ཐམས་ཅད་བྱེད་དོ།
en: His body will blaze with a hundred thousand light rays, and he will be able to do anything he wants. “

source: །དེ་ནས་དུ་བ་འཐུལ་བཞིན་པ་ནི་བསྐུས་ན་མི་སྣང་བར་འགྱུར་ཏེ། མི་སྣང་བའི་རིག་པ་འཛིན་པ་ཐམས་ཅད་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་རིག་སྔགས་འཆང་གི་རྒྱལ་པོར་འགྱུར་རོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་།
en: If he anoints his eyes with realgar that emits smoke instead, he will become invisible and become a wheel-holding vidyādhara monarch of all vidyādharas with the power to become invisible.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་ཀྱི་སྒོ་ཐམས་ཅད་བྱེ་ནས་གནས་ཏེ། གང་དུ་འདོད་པ་དེར་འཇུག་པར་བྱེད་དོ།
en: The doors to the residences of all devas, nāgas, yakṣas, rākṣasas, bhūtas, asuras, garuḍas, kinnaras, and mahoragas will remain open for him, and he will be able to enter them at will.

source: །གནས་ཐམས་ཅད་ན་གནས་པ་རྣམས་འབངས་སུ་གྱུར་ནས་གནས་ཏེ།
en: All those residing there will remain his devoted servants, eager to carry out his orders.

source: ཅི་བསྒོ་བ་བྱེད་དོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་རྗེས་སུ་འཕྲང་བར་འགྱུར་རོ།
en: All beings will become his followers.

source: །རྒྱལ་པོ་དང་བཙུན་མོའི་འཁོར་གཡོག་དང་བཅས་པས་མཆོད་པ་དང་། བླ་མར་བྱ་བའི་གནས་གཅིག་པུར་འགྱུར་རོ། །བཀའ་བསྒོ་བ་ཡང་། བདག་ཉིད་དང་། ནོར་གྱིས་ཀྱང་བྱེད་ཅིང་གནས་སོ།
en: Kings, together with their harems and retinues, will worship him as their sole teacher, take orders from him, and serve him both themselves and with their wealth. “

source: །དབུ་བ་འབྱུང་བཞིན་པ་བསྐུས་ན། ཆོ་ག་ཞིབ་མོ་དང་། ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རིགས་ཀྱི་གསང་བའི་དམ་ཚིག་མངོན་དུ་གྱུར་ནས་གནས་ཏེ།
en: If he anoints his eyes with realgar that foams, he will gain direct knowledge of all the rites, their mudrās and maṇḍalas, and the secret samayas of all the tathāgata families.

source: འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པ་རྣམས་སྔོན་དུ་གྱུར་ནས་གནས་སོ། །ལྷ་དང་།
en: All teachings of the tathāgatas—past, present, and future—will remain prominent in his memory.

source: ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་འབྲང་ཞིང་། སྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བའི་ཆེད་དུ་རྟག་པ་ཁོ་ནར་རྗེས་སུ་འགྲོའོ།
en: All devas, nāgas, yakṣas, rākṣasas, and bhūtas will be bound to him and follow him continually in order to guard, protect, and defend him.

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མངོན་སུམ་དུ་མཐོང་བ་སྦྱིན་པར་འགྱུར་རོ། །དོན་ཡོད་པའི་འོད་ཟེར་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་སྟེ། སའི་སྟེང་ནས་སོར་བཞི་ཚད་དུ་འཕགས་པའི་ནམ་མཁའ་ལ་གནས་སོ། །ལྡོང་རོས་ལ་བཟླས་ནས་མིག་ལ་བསྐུས་ནས།
en: All the buddhas and bodhisattvas will appear before his eyes, he will obtain the samādhi called possessing amogha splendor, and he will remain suspended four fingers above the ground. “

source: མིག་གིས་གང་མཐོང་བ་དེ་དབང་དུ་གྱུར་ནས་གནས་ཏེ། རྒྱལ་པོ་དང་། བཙུན་མོའི་འཁོར་དང་། བློན་པོ་དང་། བཀྲབས་པ་དང་། མདུན་ན་འདོན་དང་།
en: If he anoints his eyes with realgar that was first incanted with the mantra, anyone upon whom he casts his eyes will fall and remain under his thrall.

source: དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེ་རིགས་དང་།
en: All kings and their harems, ministers, senior priests, and entire armies with their four divisions, as well as women, men, boys, girls, monks, brahmins, kṣatriyas, vaiśyas, and śūdras, will fall under his thrall and remain so.

source: དམངས་རིགས་རྣམས་དབང་དུ་གྱུར་ནས་གནས་སོ། །ཐ་ན་རི་དགས་དང་། བྱ་ཡང་ལྟ་བར་བྱེད་བཞིན་དུ་དབང་དུ་གྱུར་ནས་ཉེ་བར་གནས་སོ།
en: Even animals and birds will fall under his thrall when he looks upon them, and they will remain so. “

source: །འདིས་བྱུགས་པའི་མིག་གི་ནད་དང་། གནོད་པ་དང་། སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་དོ།
en: All diseases, ailments, evil, and obscurations will be eradicated for the person whose eyes have been anointed with this ointment.

source: །ལུས་ཀྱི་གདུང་བ་དང་། སེམས་ཀྱི་གདུང་བ་ཐམས་ཅད་དང་། རྨི་ལམ་ངན་པ་དང་། མཚན་མ་ངན་པ་དང་། བཀྲ་མི་ཤིས་པར་གྱུར་པ་ཐམས་ཅད་རྣམས་པར་ཉམས་པར་བྱེད་དོ།
en: All his physical and mental afflictions, all his bad dreams and bad omens, and anything inauspicious will disappear.

source: །སྐྱེ་བ་བརྗེས་ནས་ཀྱང་སྤྱན་ལྔ་ཡོངས་སུ་དག་པ་སོ་སོར་ཐོབ་བོ། །ཚེ་རབས་དྲན་པར་ཡང་སྐྱེ་བར་འགྱུར་རོ།
en: When he moves on to his next birth, he will obtain the completely pure five types of vision and the ability to remember his successive births.

source: །འཇིགས་པ་དང་། སྒྲིབ་པ་དང་བྲལ་ཞིང་། དོན་ཡོད་པ་ལེགས་པར་རབ་ཏུ་གནས་པ་ཀུན་ཏུ་གཟིགས་པ་ཞེས་བྱ་བའི་ལུས་དག་པ་སོ་སོར་ཐོབ་བོ།
en: His fears and obscurations will disappear, and he will obtain a mode of physical purity called firmly fixed amogha gaze.

source: །ཀུན་ནས་དོན་ཡོད་པའི་དཀྱིལ་འཁོར་གྱི་གསང་བ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དམ་ཚིག་སོ་སོར་ཐོབ་བོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀུན་ཏུ་གཟིགས་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བ།
en: He will obtain a samaya connection with all the tathāgatas in the secret amogha maṇḍala and will obtain a bodhisattva consecration called the banner of the compassionate gaze that combines the gazes of all tathāgatas.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་བསྐུར་བ་སོ་སོར་ཐོབ་བོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་རྟག་ཏུ་ཡང་འགྲོགས་ཤིང་གནས་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ལུང་བསྟན་པར་འགྱུར་རོ།
en: He will always have a close relationship with all the bodhisattvas and will obtain from all tathāgatas a prophecy about his future awakening. “

source: །ཞེས་སོ་མིག་སྨན་གྱི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའོ།། །།
en: This concludes the instructions on the maṇḍala procedure of the ointment. “

source: དེ་ནས་བདུག་པ་རིམ་པར་ཕྱེ་བའི་ཆོ་ག་བཤད་པར་བྱ་སྟེ། རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་རྨད་དུ་བྱུང་བ། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཆོད་པའི་དོན་དང་། དེ་བཞིན་ཉིད་དུ་འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་འགུགས་པ་གྲུབ་པ་དང་། ལྷ་ཐམས་ཅད་སྤྱན་དྲང་བ་དང་། དབང་པོ་དང་།
en: Now I will teach all vidyā holders the procedure called veil of incense, a marvelous, supreme method for worshiping all buddhas and bodhisattvas.

source: ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་རྣམས་བསྡིགས་པར་བྱེད་པ། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་།
en: It is effective for convening the three worlds and in summoning all deities including Indra, Brahmā, Viṣṇu, and Maheśvara, as well as for threatening terrible yakṣas, rākṣasas, piśācas, and grahas, all of whom will flee when they smell the incense.

source: ཤ་ཟ་དང་། གདོན་མ་རུངས་པ་དེ་རྣམས་ཐམས་ཅད་བདུག་པའི་དྲིས་འབྲོས་པར་བྱེད་པར་ཐེ་ཙོམ་མེད་དོ།
en: There is no doubt about this.

source: །བགེགས་དང་ལོག་པར་འདྲེན་པ་ཉིད་དང་། སྡང་བ་དང་། དེ་བཞིན་དུ་བདུད་ཀྱང་རུང་སྟེ། བདུག་པའི་དྲིས་རྣམ་པར་ཞིག་པར་འགྱུར་ཞིང་། ཡན་ལག་དང་ཉིང་ལག་རྣམ་པར་འཐོར་བར་བྱེད་དོ།
en: Vighnas, vināyakas, and wicked māras will also be assailed by the smell of the incense and will lose their limbs.

source: །རང་གི་དམག་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། ཤིན་ཏུ་འགྲས་པ་དང་། ཕྱིར་རྒོལ་བ་དང་། དེ་བཞིན་དུ་དགྲ་བོ་ཉིད་དང་། སྐྱེ་བོ་སྡང་བ་དང་། གང་དུ་འཐབ་པ་དང་།
en: The same will happen to hostile armies, whether one’s own or foreign, and to adversaries and opponents.

source: རྩོད་པ་དང་། འགྱེད་པ་དང་། གཡུལ་ཉིད་ཀྱང་བདུག་པའི་དྲིས་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་བར་ཐེ་ཚོམ་མེད་དོ། །གལ་ཏེ་སྐྱེས་པའམ། བུད་མེད་དམ། ཁྱེའུ་འམ། བུ་མོའམ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་ཉིད་དང་། དེ་བཞིན་དུ་དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། རྒྱལ་པོ་འམ། རྒྱལ་ཕྲན་དང་།
en: All instances of mutual hatred, quarrels, disputes, fighting, and wars will certainly be pacified by the scent of the incense, regardless of whether those involved are men, women, boys, girls, ascetics, brahmins, male or female lay practitioners, monks, nuns, kings, queen dowagers, queens, or the women of the royal harem. “

source: དེ་བཞིན་དུ་རྒྱལ་མོ་དང་། བཙུན་མོའི་འཁོར་ཀྱང་རུང་སྟེ། ལེགས་པར་ཁྲུས་བྱས། གོས་གཙང་མ་བགོས་ནས་བདུག་སྤོས་འདིས་བདུགས་ན་གང་གིས་བདུགས་པའི་དྲི་མནམས་པ་དང་།
en: The vidyā holder should be thoroughly bathed, put on clean clothes, and burn the incense.

source: དེ་ལུས་ལ་རེག་པ་ཙམ་གྱིས་སྡིག་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་ལོ།
en: Anyone whom the scent reaches and who smells it will be freed from all negativity as soon the scent contacts their body.

source: །སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་བདག་ཉིད་ཐོབ་པར་འགྱུར་ཏེ། འདི་ལ་ཐེ་ཚོམ་མེད་དོ།
en: All their obscurations will be completely purified; there is no doubt about this.

source: །མཚམས་མེད་པ་ལྔའི་སྡིག་པ་རྣམས་འཕྲལ་དུ་ཐམས་ཅད་རྣམ་པར་དག་པར་འགྱུར་རོ་ཞེས་སོ།
en: Even the five inexpiable acts will be instantly purified.

source: །བདུག་པ་འདི་ཙམ་གྱིས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དྲིས་ཀུན་ཏུ་འགེངས་ཏེ། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་གནས་ནས་ཇི་སྲིད་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དྲིས་ཀུན་ཏུ་འགེངས་སོ།
en: As soon as the incense is burned, the world spheres of the great trichiliocosm will be filled with the scent, including the gods’ realm of Thirty-Three and the Brahmaloka. “

source: །སྟོབས་དང་ཤུགས་ཆེན་པོས་ལྷའི་གནས་ཐམས་ཅད་འགུལ་བར་བྱེད་ཅིང་སྐྱོད་པར་བྱེད་དོ།
en: The great trichiliocosm will quake violently and with great force.

source: །ཆུ་རྒྱུན་གྱི་ཀླུ་རྣམས་འགུལ་བར་བྱེད་ཅིང་།
en: All the devas and their palaces will shake, as will the nāgas who control rainfall.

source: རི་རབ་ལས་གཞན་པའི་རི་གང་ཡིན་པ་འདར་ཡེད་ཡེད་བྱེད་དོ། །གསང་བར་གནས་པ་རྣམས་རྣམ་པར་སྐྲག་པར་བྱེད་དོ། །དམྱལ་བ་བཅུ་དྲུག་གི་འཇིགས་པ་རྣམས་རྣམ་པར་ཞིག་པར་བྱེད་དོ། །དེ་བཞིན་དུ། སའི་མཐའི་ཐམས་ཅད་ཀྱང་དཀར་བསིལ་དུ་སྣང་བར་འགྱུར་རོ།
en: Mount Sumeru and other mountains will tumble, the inhabitants of the hidden worlds will shake, and the sixteen terrible hells will be perturbed.

source: །དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་ཤིན་ཏུ་སྦྱངས་པ་དང་། སྡུག་བསྔལ་མི་བཟད་པ་དེ་རྣམས་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་ཏེ། བདེ་བ་ཅན་དུ་ཡང་འགྲོའོ། །མཐོ་རིས་ཐམས་ཅད་དུ་ཇི་ལྟ་བ་བཞིན་དུ་གནས་སོ། །དམྱལ་བ་ཐམས་ཅད་ཉམས་ཏེ།
en: All those who live on earth will attain tranquility, while all hell beings will attain stillness, be released from their terrible suffering, and transmigrate to Sukhāvatī.

source: པདྨ་ཅན་དུ་རབ་ཏུ་འགྱུར་རོ། །ཉི་ཚེ་བའི་དམྱལ་བ་རྣམ་པ་སྣ་ཚོགས་པ་གཞན་རྣམས་དང་། ས་འོག་གི་ནང་དུ་སོང་བ་གང་ཡིན་པ་དང་།
en: As they reach heaven, all sixteen hells will cease to exist, morphing instead into lotus lakes. “

source: དགོན་པ་དང་། རི་དང་། ཚང་ཚིང་དང་། དགོན་དུང་དང་། གཡང་སར་གནས་པའི་དམྱལ་བའི་སྡུག་བསྔལ་མྱོང་བ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་བདུག་པའི་དྲིས་ཡོངས་སུ་གྲོལ་ལོ།
en: All beings who dwell in various other individual hells and subterranean realms, who dwell in forests, impenetrable mountain thickets, jungles, and steep mountains, and who undergo the sufferings of hell will be liberated by the scent of the incense.

source: །མི་གཙང་བ་ཟ་བའི་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་གང་ཡིན་པ་རྣམས་དང་། བཤང་བ་དང་།
en: All yakṣas, rākṣasas, bhūtas, and piśācas who live on impure food, who live on feces, excrement, and urine, who live on phlegm and snot, and who feed on garbage will be liberated as soon as they smell the incense.

source: གཅི་བ་ཟ་བ་གང་ཡིན་པ་རྣམས་དང་། མཆིལ་མ་དང་། སྣབས་ཟ་བ་གང་ཡིན་པ་རྣམས་དང་། འདྲེས་པ་ཟ་བ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་བདུག་པའི་དྲི་མནམས་པ་ཙམ་གྱིས་ཡོངས་སུ་གྲོལ་ནས་འཕྲལ་ཉིད་དུ་ལྷའི་འཇིག་རྟེན་དུ་སྐྱེའོ། །རྣམ་པ་སྣ་ཚོགས་པའི་རོ་བྲོ་བའི་མཆོག་དང་།
en: They will instantly be transported to the realms of gods, where they will obtain the best, exquisite-tasting food of various kinds and tastes. “

source: དྲི་ཞིམ་པོའི་ཁ་ཟས་རྙེད་པར་འགྱུར་རོ། །དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སྲོག་ཆགས་རི་དགས་དང་། བྱ་རྣམས་ཐམས་ཅད་དྲིལ་མནམས་པ་ཙམ་གྱིས་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་ལོ།
en: All creatures of the animal realm, such as deer and birds, will be freed from their diseases as soon as they smell the incense.

source: །བདུག་པ་མནམས་པ་ཙམ་འདིས་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་ལོ། །རིམས་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་ལོ། །ན་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་ལོ། །འབྲས་དང་། ཕོལ་མིག་དང་། ལྷོག་པ་དང་། མེ་དབལ་དང་། ཤུ་བ་དང་། མཛེ་དང་། གཡན་པ་དང་། མིག་ན་བ་དང་། མགོ་བོ་ན་བ་དང་། གཞོགས་ཕྱེད་ན་བ་དང་། རྣ་བ་ན་བ་དང་། སྣ་ན་བ་དང་། སོ་ན་བ་དང་།
en: As soon as they smell the smoke of the incense, they will all be freed from disease, including all types of fever.

source: ཁ་ན་བ་དང་། སྦ་བ་དང་། འཇིགས་པ་དང་། སྐྲག་པ་དང་། ནད་འགོ་བ་དང་།
en: They will be freed from all their ailments, including boils, blisters, festering abscesses, erysipelas, cutaneous eruptions, leprosy, scabs, eye diseases, diseases of the head, hemiplegia, diseases of the ear or nose, dental problems, diseases of the mouth, asthma attacks, fear, and anxiety, as well as from all accidents, misfortunes, fatigue, and pain.

source: འཁྲུག་པའི་སྡུག་བསྔལ་ཐམས་ཅད་བདུག་པའི་དྲི་བསྣམས་པ་ཙམ་གྱིས་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: They will obtain peace as soon as they smell the incense.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དེ་དང་། དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོའི་མཐུ་ཡིས་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་བའི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་ཅིང་།
en: By the power of the Amogharāja mantra, the heart essence of Noble Avalokiteśvara, all their suffering and pain and all their karmic obscurations will disappear.

source: རྣམ་པར་གྲོལ་ཏེ་མི་འཇིགས་པའི་གྲོང་དུ་འགྲོ་བར་འགྱུར་རོ། །དེ་ནས་རྫས་རྣམས་ཀྱི་རང་གི་ཆ་ཤས་རྣམ་པར་ཕྱེ་བ་དང་ལྡན་པ་བཤད་པར་བྱ་སྟེ། ཙནྡན་སྲང་གསུམ་དང་། ཨ་ག་རུ་སྲང་གསུམ་དང་། དུ་རུ་སྐ་སྲང་ལྔ་དང་། གུར་གུམ་སྲང་བཅུ་དང་། སྤྲྀ་ཀ་སྲང་གཉིས་དང་། ན་ལན་ད་སྲང་གཉིས་དང་། མ་ཧེའི་མིག་སྲང་ཉི་ཤུ་དང་།
en: Once liberated, they will proceed to the city of fearlessness. “

source: སྲ་རྩི་པོ་ག་སྲང་བཅུ་དང་། བོ་ལ་སྲང་གསུམ་དང་། སལླ་ཀཱི་སྲང་བརྒྱད་དང་། རྒྱ་སྤོས་སྲང་གཉིས་དང་། སྤང་སྤོས་སྲང་གཅིག་དང་། ཤཱ་མ་ཀ་སྲང་གཅིག་དང་། གནྡྷ་པ་ཏྲ་སྲང་གཅིག་དང་། པདྨ་གེ་སར་སྲང་གཅིག་དང་། ཤྲིརཱི་མའི་མེ་ཏོག་སྲང་གཅིག་དང་། ལི་ཁ་ར་དཀར་པོ་སྲང་བཅུ་དང་། དྲིའི་པྲི་ཡང་ཀུ་སྲང་གཅིག་དང་། པུ་ཤེལ་ཙི་སྲང་ལྔ་དང་། སྟག་སེན་སྲང་གཅིག་དང་། སུག་སྨེལ་སྲང་གསུམ་དང་། བཱ་ལ་ཀ་སྲང་ལྔ་དང་།
en: Now I will proclaim the names of the ingredients and the amounts required: three palas of sandalwood, three palas of agarwood, five palas of olibanum, ten palas of saffron, two palas of fenugreek, two palas of nalanda, twenty palas of mahiṣākṣa, ten palas of sarjarasa, three palas of myrrh, eight palas of sallakī, two palas of tagara, one pala of gandhamāṃsī, one pala of śāmaka, one pala of gandhapattra, one pala of lotus filaments, one pala of śirīṣa blossoms, ten palas of white sugar, one pala of mahaleb cherry, five palas of the root of khas grass, one pala of nakha, one pala of vyāghranakha, three palas of cardamom, and five palas of vālaka, saffron, musk, and vedana.

source: གུར་གུམ་དང་། གླ་རྩི་ཚོར་བ་སྟེ། ཐམས་ཅད་ལེགས་པར་རྣམ་པར་དབྱེ་བར་བྱས་ནས། ཕྱེ་མར་བྱས་ལ་མཐར་ཐམས་ཅད་གཅིག་ཏུ་བསྡོམས་ཏེ། སྦྲང་རྩིས་སྦྲུ་བར་བྱའོ།
en: All these ingredients should be carefully weighed according to the right measure, ground together into a homogenous mass, and blended with madhura. “

source: །ཚེས་བཅོ་ལྔ་ལ། རྒྱུ་སྐར་དང་། ཚེས་གྲངས་ཀྱི་ལྷ་དགེ་བ་ལ།
en: The vidyā holder should use this supreme incense on the day of the full moon, when the nakṣatras and the patron deities of the lunar day are auspicious.

source: རིག་སྔགས་འཆང་གཙང་མར་གྱུར་པས་གོས་གཙང་མ་བགོས་ཏེ། ལེགས་པར་ཁྲུས་བྱས་པར་གྱུར་པས་བརྟུལ་ཞུགས་སྤྱད་པས་བདུག་པའི་མཆོག་སྦྱར་བར་བྱའོ།
en: He must be ritually pure and thoroughly washed, wear clean clothes, and keep his religious vows.

source: །དེ་ནས་བདུག་པའི་རྒྱལ་པོ་སྒྲུབ་པའི་དཀྱིལ་འཁོར་གྲུ་བཞི་པ་ཚད་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་བྱ་སྟེ།
en: The practice procedure for this king of incense is as follows. He should demarcate, according to the right measure, a symmetrical, four-sided maṇḍala.

source: གཟིངས་ཀྱི་ཚད་ཀྱི་ཤིན་ཏུ་བཅགས་པ། འཇམ་ཞིང་བསྙེན་པ་ལ། ཚོན་རྣམ་པ་སྣ་ཚོགས་པས་སྒོ་བཞི་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། མཛེས་པར་བྲི་བར་བྱའོ།
en: Its surface should be the size of a boat and be wiped clean, smooth and soft, and painted in different colors. It should be adorned with four doors symmetrically arranged. “

source: །དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོར། པདྨའི་ཕྲེང་བ་བྲིའོ། །དབུས་ཀྱི་པདྨ་ཕྱེད་ཁ་བྱེ་བའི་ཕྲེང་བ་བྲི་སྟེ།
en: Inside the maṇḍala, the vidyā holder should draw rows of lotuses, inside of which are rows of half-opened lotuses.

source: ལག་པ་གཉིས་འཐོན་ནས་སྣ་ཚོགས་པའི་སྤྲིན་འཁྲིགས་པ་འཛིན་པར་བྱེད་པའོ།
en: He should then draw a pair of hands that support a mass of clouds.

source: །དེའི་སྟེང་དུ་བདུག་པའི་སྣོད་བཀོད་ནས། མེའི་ཁ་དོག་ཅན་གྱི་གོས་ཀྱིས་གཡོགས་ལ།
en: On top of them he should place the bowl containing the incense and cover it with cloth the color of fire.

source: དཀྱིལ་འཁོར་གྱི་གྲྭ་བཞི་རྣམས་སུ། རླུང་གི་རྒྱལ་པོ་བྲིའོ། །སྒོ་བཞིར་ཞགས་པ་བྲིས་ནས་ཁོར་ཡུག་ཏུ་ལག་པའི་ཕྱག་རྒྱའོ།
en: He should draw Vāyu, the king of wind, in the four corners of the maṇḍala, and at each of the four doors he should draw a noose.

source: །པདྨའི་ཕྲེང་བ་ལས་ངེས་པར་འཐོན་པའོ། །བདུག་སྤོས་འཁྱིལ་པ་འཆང་བར་བྱེད་པ་དཀྱིལ་འཁོར་གྱི་སྟེང་དུ་སྤྲས་པར་བྱའོ།
en: He should also draw hands, displaying mudrās and holding incense, that emerge in all directions from the row of lotuses, drawn to seem like they are rising above the maṇḍala. “

source: །ཇི་ལྟར་འབྱོར་པའི་གཏོར་མ་དང་མེ་ཏོག་དབུལ་བར་བྱ། མཆོད་ཡོན་གྱི་སྣོད་དང་། གང་བའི་བུམ་པ་དང་། བ་དན་དང་། རྒྱན་དང་།
en: The vidyā holder should offer whatever bali articles and flowers are available, arrange bowls with argha water and other full jars, and adorn the maṇḍala with banners.

source: སྐུད་པ་དམར་པོས་མཚམས་བཅིང་བ་དང་། དཀྱིལ་འཁོར་ལ་དངུལ་དང་། གསེར་བཞག་ཅིང་། ཁོར་ཡུག་ཏུ་མར་མེའི་ཕྲེང་བ་དང་། དྲི་སྣ་ཚོགས་རྒྱ་ཆེན་པོའོ།
en: He should surround the maṇḍala with a red thread to create a boundary, set out silver and gold, arrange rows of lamps all around it, and skillfully apply various fragrances.
